app/controllers/movies_controller.rb

  def index
    @movies = Movie.all    #set @movie instance var so that it can be used to display movies
---
SELECT "movies".* FROM "movies"

  def create
    @movie = Movie.new(movie_params)

     if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["rating", ""], ["description", ""], ["created_at", "2021-10-07 08:07:16.292010"], ["updated_at", "2021-10-07 08:07:16.292010"]]